projects/pimpleReact/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0     0      0)      // 0
    (0.05  0      0)      // 1
    (0.05  0.0025 0)      // 2
    (0     0.0025 0)      // 3

    (0     0      0.1)    // 4
    (0.05  0      0.1)    // 5
    (0.05  0.0025 0.1)    // 6
    (0     0.0025 0.1)    // 7

    (0.05  0.005  0)      // 8
    (0     0.005  0)      // 9
    (0.05  0.005  0.1)    // 10
    (0     0.005  0.1)    // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7)       (40 20 100) simpleGrading (1 5 1)
    hex (3 2 8 9 7 6 10 11)     (40 20 100) simpleGrading (1 -5 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)   // z = 0
            (3 2 8 9)   // z = 0
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 7 6 5)   // z = 0.1
            (7 11 10 6)   // z = 0.1
        );
    }

    cathode
    {
        type wall;
        faces
        (
            (0 4 5 1)   // y = 0

        );
    }

    anode
    {
        type wall;
        faces
        (

            (9 8 10 11)   // y = 0.01
        );
    }

    wall
    {
        type wall;
        faces
        (
            (0 3 7 4)   // x = 0
            (1 5 6 2)   // x = 0.05
            (3 9 11 7)   // x = 0
            (2 6 10 8)   // x = 0.05
        );
    }
);
mergePatchPairs
(
);
