projects/pimpleReact/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
160000
(
0.000625
0.001875
0.003125
0.004375
0.005625
0.006875
0.008125
0.009375
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
...
)
;
    }
    cathode
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
...
)
;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
0.000625
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
