projects/pimpleReact/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
160000
(
2.48758e-05
2.48758e-05
2.48758e-05
2.48758e-05
2.48758e-05
2.48758e-05
2.48758e-05
2.48758e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
2.48758e-05
7.68263e-05
0.000133369
0.00019491
0.000261892
0.000334794
0.000414141
0.000500502
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
2.48758e-05
7.68263e-05
0.000133369
0.00019491
0.000261892
0.000334794
0.000414141
0.000500502
...
)
;
    }
    cathode
    {
        type            calculated;
        value           uniform 0;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
2.48758e-05
7.68263e-05
0.000133369
0.00019491
0.000261892
0.000334794
0.000414141
0.000500502
...
)
;
    }
}


// ************************************************************************* //
