projects/pimpleReact/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
160000
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;
    }
    cathode
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
0.0005
0.0015
0.0025
0.0035
0.0045
0.0055
0.0065
0.0075
...
)
;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
0.0005
0.0015
0.0025
0.0035
0.0045
0.0055
0.0065
0.0075
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
}


// ************************************************************************* //
